00001-combo-001.org
#+TITLE: Book Reading Combo #1
#+SETUPFILE: theme.setup
#+INCLUDE: ./nav.org

* #Combo in Combo#
** 码农: 进击的 Java
- 码农; 图灵社区. 码农·进击的Java（总第16期） (Kindle Location 21). 人民邮电出版社. Kindle Edition.
- 一个不错的点: 读源码不要一行一行读, 要带着目标, 追主线.
** 科技之巅 《麻省理工科技评论》50大全球突破性技术深度剖析
- tzx: 感觉太空, 电池, 基因, AI 是热点
- 原来除了 SpaceX, Jeff Bezos 也有一个太空相关的公司, 叫 Blue Origin, 而且比 SpaceX 提前成功发射可以降落的火箭
- Slack 是一种智能沟通机器人
- 虚拟现实, 自动驾驶, 车对车通信 (V2V communication), 基因工程, 太阳能, 风能
- 在“ 液体 活 检”（ liquid biopsy）
- 支付, apple pay
- Microscale 3- D Printing 微型 3D 打印
- Mobile Collaboration 移动协作: quip
- blue ocean
- Neuromorphic Chips 神经 形态 芯片
- Agricultural Drones 农用 无 人机
- Prenatal DNA Sequencing 产前 DNA 测 序
- Supergrids 超级 电网
- Light- Field Photography 光 场 摄影 术
- High-Speed Materials Discovery 高速筛选电池材料
* 金字塔原理
** 中文版序
{{{begin-summary}}}
《金字塔原理》介绍了一种能清晰地展现思路的有效方法。掌握了金字塔原理，
就能重点突出，逻辑清晰。不管是在政界、商界、学界，还是在企事业单位，所
有高、中、基层职场人士，只要你需要思考和沟通，就会从金字塔原理受益。金
字塔结构思考力是领导力的必要素质，本书是训练思考、使表达呈现逻辑性的实
用宝典。

金字塔原理的基本概念:

- 金字塔原理是一种重点突出、逻辑清晰、层次分明、简单易懂的思考方式、沟通方式、规范动作。
- 金字塔原理的基本结构是：结论先行，以上统下，归类分组，逻辑递进。先重要后次要，先总结后具体，先框架后细节，先结论后原因，先结果后过程，先论点后论据。
- 金字塔原理训练表达者：关注、挖掘受众的意图、需求点、利益点、关注点和兴趣点，想清说什么（内容），怎么说（思路、结构），掌握沟通的标准结构、规范动作。
- 金字塔能够达到的沟通效果：观点鲜明、重点突出、思路清晰、层次分明、简单易懂，让受众有兴趣，能理解，记得住。
- 搭建金字塔结构的具体做法是：自上而下表达，自下而上思考，纵向总结概括，横向归类分组，序言讲故事，标题提炼思想精华。
{{{end-summary}}}
** 前言
1967 年还很少有人接受我的理论，但是麦肯锡公司的一些智者却慷慨地指出了
我的理论中存在的问题，帮助我改进。现在，金字塔原理已经成为麦肯锡公司的
标准，并被麦肯锡看做是其公司理念和规范的重要组成部分。

实际应用金字塔原理需要相当的毅力。但是，如果你有意地以书中介绍的方法强迫自己“先想后写”，你的写作能力肯定能够得到惊人的改善，使你能够：

- 缩短完成最终一稿通常所需的时间；
- 提高文章的条理性；
- 缩短文章的长度。最终的结果是，使你能够在最短的时间内写出简明扼要、思路清晰的文章。
** 第 1 篇 表达的逻辑
文章条理不清还有一个比上面提到的原因更常见、但也更容易改进的原因，即文
章的结构（structure）——也就是句子的组织顺序（不管句子本身写得是好是坏）。

金字塔结构中，思想之间的联系方式可以是纵向的（vertically）——即任何一个
层次上的思想都是对其下面一个层次上思想的总结；也可以是横向的
（horizontally）——即多个思想因共同组成同一个逻辑推理过程，而被并列排在一起。
*** 第 1 章 为什么要用金字塔结构
如果你的文章结构呈金字塔形，文章的思路自金字塔顶部开始逐渐向下展开，那
么读者肯定会觉得你的文章比较容易读懂。

- 你可以通过检查你的思想是否用金字塔结构相互关联，从而确定你是否正确地构建了文章的结构。 ::
    - 金字塔中的思想以 3 种方式互相关联——向上、向下和横向。位于一组思想的上一个层次的思想是对这一组思想的概括，这一组思想则是对其上一层次思想的解释和支持。
    - 文章中任一层次上的思想必须是对其下一层次思想的总结概括
    - 每组中的思想必须属于同一逻辑范畴
    - 每组中的思想必须按照逻辑顺序组织 \\
    组织思想基本上只可能有4种逻辑顺序：
    + 演绎顺序：大前提、小前提、结论
    + 时间（步骤）顺序：第一、第二、第三
    + 结构（空间）顺序：波士顿、纽约、华盛顿
    + 程度（重要性）顺序：最重要、次重要，等等
**** 归类分组，将思想组织成金字塔
- 逻辑关系
- 7
- 归类分组, 搭建金字塔
- 找出逻辑关系, 抽象概括
**** 自上而下表达，结论先行
**** 自下而上思考，总结概括
*** 第 2 章 金字塔内部的结构
金字塔中的子结构，能够加快你梳理思想的过程：
- 主题与子主题之间的纵向关系
- 各子主题之间的横向关系
- 序言的叙述方式
**** 纵向关系
- 这种表述之所以清晰，是因为其思想的组织一直紧紧围绕着回答由主题引发的读者的疑问。
- 金字塔结构的巨大价值就在于它迫使你在理清思路时，从视觉上使纵向的疑问／回答式对话关系清晰化。
**** 横向关系
- 演绎性思想组合是由几个承前启后的论述组成的。
- 归纳性思想组合中的思想互相关联，
**** 序言的结构
问题的起源和发展必然以叙述的形式出现，因此也应当按照典型的叙述模式发展。
序言的开头应向读者说明“背景”（situation）的时间和地点。
在这一背景中应当发生了某件事情，可称为“冲突”（complication），
使读者提出（或将使读者提出）你的文章将要“回答”（answer）的“疑问”（question）。
*** 第 3 章 如何构建金字塔
**** 自上而下法
自上而下法构建金字塔的步骤：
- 提出主题思想。
- 设想受众的主要疑问。
- 写序言：背景－冲突－疑问－回答。
- 与受众进行疑问/回答式对话。
- 对受众的新疑问，重复进行疑问/回答式对话。
**** 自下而上法
自下而上思考：
- 列出你想表达的所有思想要点。
- 找出各要点之间的逻辑关系。
- 得出结论。
**** 初学者注意事项
- 一定先搭结构，先尝试自上而下法
- 序言先写背景，将背景作为序言的起点
- 先多花时间思考序言，不要省略
- 将历史背景放在序言中
- 序言仅涉及读者不会对其真实性提出质疑的内容
- 在关键句层次上，更宜选择归纳推理法而非演绎论证法 (interesting)
*** 第 4 章 序言的具体写法
文章的序言（前言、引言、导言）概述读者已知的信息，并将这些信息与文章将
要回答的疑问建立联系，然后作者就可以将全部精力放在提供回答疑问的答案上。
如果是写文章，就是“序言”； *如果是演讲，就是“开场白”。*
