00001-combo-001.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Book Reading Combo #1</title>
<!-- 2017-10-07 Sat 13:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="TANG ZhiXiong" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="css/github-gist.min.css">
<link rel="stylesheet" type="text/css" href="css/main.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Book Reading Combo #1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. ☰</a>
<ul>
<li><a href="#sec-1-1">1.1. Meta Notes</a></li>
<li><a href="#sec-1-2">1.2. Books</a></li>
</ul>
</li>
<li><a href="#sec-2">2. #Combo in Combo#</a>
<ul>
<li><a href="#sec-2-1">2.1. 码农: 进击的 Java</a></li>
<li><a href="#sec-2-2">2.2. 科技之巅 《麻省理工科技评论》50大全球突破性技术深度剖析</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 金字塔原理</a>
<ul>
<li><a href="#sec-3-1">3.1. 中文版序</a></li>
<li><a href="#sec-3-2">3.2. 前言</a></li>
<li><a href="#sec-3-3">3.3. 第 1 篇 表达的逻辑</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. 第 1 章 为什么要用金字塔结构</a></li>
<li><a href="#sec-3-3-2">3.3.2. 第 2 章 金字塔内部的结构</a></li>
<li><a href="#sec-3-3-3">3.3.3. 第 3 章 如何构建金字塔</a></li>
<li><a href="#sec-3-3-4">3.3.4. 第 4 章 序言的具体写法</a></li>
<li><a href="#sec-3-3-5">3.3.5. 第 5 章 演绎推理与归纳推理 (easy)</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. 第 2 篇 思考的逻辑</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. 第 6 章 应用逻辑顺序</a></li>
<li><a href="#sec-3-4-2">3.4.2. 第 7 章 概括各组思想</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. 第 3 篇 解决问题的逻辑</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. <span class="todo TODO">TODO</span> 第 8 章 界定问题</a></li>
<li><a href="#sec-3-5-2">3.5.2. <span class="todo TODO">TODO</span> 第 9 章 结构化分析问题</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. 第 4 篇 演示的逻辑</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. 第 10 章 在书面上呈现金字塔</a></li>
<li><a href="#sec-3-6-2">3.6.2. 第 11 章 在 PPT 演示文稿中呈现金字塔</a></li>
<li><a href="#sec-3-6-3">3.6.3. 第 12 章 在字里行间呈现金字塔</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7. 附录 1 在无结构情况下解决问题的方法</a></li>
<li><a href="#sec-3-8">3.8. 附录 2 序言结构范例</a></li>
<li><a href="#sec-3-9">3.9. <span class="todo TODO">TODO</span> 附录 3 本书要点汇总</a>
<ul>
<li><a href="#sec-3-9-1">3.9.1. 第 1 章: 为什么要用金字塔结构</a></li>
<li><a href="#sec-3-9-2">3.9.2. 第 2 章: 金字塔内部的结构</a></li>
<li><a href="#sec-3-9-3">3.9.3. 第 3 章: 如何构建金字塔</a></li>
</ul>
</li>
<li><a href="#sec-3-10">3.10. 参考文献</a></li>
</ul>
</li>
<li><a href="#sec-4">4. <span class="todo TODO">TODO</span> Beast Machines: Transformers (cartoon)</a>
<ul>
<li><a href="#sec-4-1">4.1. Introduction</a></li>
<li><a href="#sec-4-2">4.2. Quotes</a></li>
<li><a href="#sec-4-3">4.3. Season 1</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. The Reformatting</a></li>
<li><a href="#sec-4-3-2">4.3.2. Master of the House</a></li>
<li><a href="#sec-4-3-3">4.3.3. Fires of the Past</a></li>
<li><a href="#sec-4-3-4">4.3.4. Mercenary Pursuits</a></li>
<li><a href="#sec-4-3-5">4.3.5. Forbidden Fruit</a></li>
<li><a href="#sec-4-3-6">4.3.6. The Weak Component</a></li>
<li><a href="#sec-4-3-7">4.3.7. Revelations Part I: Discovery</a></li>
<li><a href="#sec-4-3-8">4.3.8. Revelations Part II: Descent</a></li>
<li><a href="#sec-4-3-9">4.3.9. Revelations Part III: Apocalypse</a></li>
<li><a href="#sec-4-3-10">4.3.10. Survivor</a></li>
<li><a href="#sec-4-3-11">4.3.11. The Key</a></li>
<li><a href="#sec-4-3-12">4.3.12. The Catalyst</a></li>
<li><a href="#sec-4-3-13">4.3.13. End of the Line</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. Season 2: Battle for the Spark</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. Fallout</a></li>
<li><a href="#sec-4-4-2">4.4.2. Savage Noble</a></li>
<li><a href="#sec-4-4-3">4.4.3. Prometheus Unbound</a></li>
<li><a href="#sec-4-4-4">4.4.4. In Darkest Knight</a></li>
<li><a href="#sec-4-4-5">4.4.5. A Wolf in the Fold</a></li>
<li><a href="#sec-4-4-6">4.4.6. Home Soil</a></li>
<li><a href="#sec-4-4-7">4.4.7. Sparkwar Pt. I: The Strike</a></li>
<li><a href="#sec-4-4-8">4.4.8. Sparkwar Pt. II: The Search</a></li>
<li><a href="#sec-4-4-9">4.4.9. Sparkwar Pt. III: The Siege</a></li>
<li><a href="#sec-4-4-10">4.4.10. Spark of Darkness</a></li>
<li><a href="#sec-4-4-11">4.4.11. Endgame Pt. I: The Downward Spiral</a></li>
<li><a href="#sec-4-4-12">4.4.12. Endgame Pt. II: When Legends Fall</a></li>
<li><a href="#sec-4-4-13">4.4.13. Endgame Pt. III: Seeds of the Future</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ☰</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./index.html">Main Entry</a>
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Meta Notes</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="./00001-emacs-org-mode.html">Emacs/Org-mode Notes</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Books</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="./00002-javascript-the-good-parts.html">JavaScript: The Good Parts</a>
</li>
<li><a href="./00003-effective-java.html">Effective Java</a>
</li>
<li><a href="./00004-domain-specific-languages.html">Domain Specific Languages</a>
</li>
<li><a href="./00001-combo-001.html">Combo #1</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> #Combo in Combo#</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 码农: 进击的 Java</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>码农; 图灵社区. 码农·进击的Java（总第16期） (Kindle Location 21). 人民邮电出版社. Kindle Edition.
</li>
<li>一个不错的点: 读源码不要一行一行读, 要带着目标, 追主线.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 科技之巅 《麻省理工科技评论》50大全球突破性技术深度剖析</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>tzx: 感觉太空, 电池, 基因, AI 是热点
</li>
<li>原来除了 SpaceX, Jeff Bezos 也有一个太空相关的公司, 叫 Blue Origin, 而且比 SpaceX 提前成功发射可以降落的火箭
</li>
<li>Slack 是一种智能沟通机器人
</li>
<li>虚拟现实, 自动驾驶, 车对车通信 (V2V communication), 基因工程, 太阳能, 风能
</li>
<li>在“ 液体 活 检”（ liquid biopsy）
</li>
<li>支付, apple pay
</li>
<li>Microscale 3- D Printing 微型 3D 打印
</li>
<li>Mobile Collaboration 移动协作: quip
</li>
<li>blue ocean
</li>
<li>Neuromorphic Chips 神经 形态 芯片
</li>
<li>Agricultural Drones 农用 无 人机
</li>
<li>Prenatal DNA Sequencing 产前 DNA 测 序
</li>
<li>Supergrids 超级 电网
</li>
<li>Light- Field Photography 光 场 摄影 术
</li>
<li>High-Speed Materials Discovery 高速筛选电池材料
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 金字塔原理</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 中文版序</h3>
<div class="outline-text-3" id="text-3-1">
<div class="tzx-summary"><strong>Summary</strong>
<p>
《金字塔原理》介绍了一种能清晰地展现思路的有效方法。掌握了金字塔原理，
就能重点突出，逻辑清晰。不管是在政界、商界、学界，还是在企事业单位，所
有高、中、基层职场人士，只要你需要思考和沟通，就会从金字塔原理受益。金
字塔结构思考力是领导力的必要素质，本书是训练思考、使表达呈现逻辑性的实
用宝典。
</p>

<p>
金字塔原理的基本概念:
</p>

<ul class="org-ul">
<li>金字塔原理是一种重点突出、逻辑清晰、层次分明、简单易懂的思考方式、沟通方式、规范动作。
</li>
<li>金字塔原理的基本结构是：结论先行，以上统下，归类分组，逻辑递进。先重要后次要，先总结后具体，先框架后细节，先结论后原因，先结果后过程，先论点后论据。
</li>
<li>金字塔原理训练表达者：关注、挖掘受众的意图、需求点、利益点、关注点和兴趣点，想清说什么（内容），怎么说（思路、结构），掌握沟通的标准结构、规范动作。
</li>
<li>金字塔能够达到的沟通效果：观点鲜明、重点突出、思路清晰、层次分明、简单易懂，让受众有兴趣，能理解，记得住。
</li>
<li>搭建金字塔结构的具体做法是：自上而下表达，自下而上思考，纵向总结概括，横向归类分组，序言讲故事，标题提炼思想精华。
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 前言</h3>
<div class="outline-text-3" id="text-3-2">
<p>
1967 年还很少有人接受我的理论，但是麦肯锡公司的一些智者却慷慨地指出了
我的理论中存在的问题，帮助我改进。现在，金字塔原理已经成为麦肯锡公司的
标准，并被麦肯锡看做是其公司理念和规范的重要组成部分。
</p>

<p>
实际应用金字塔原理需要相当的毅力。但是，如果你有意地以书中介绍的方法强迫自己“先想后写”，你的写作能力肯定能够得到惊人的改善，使你能够：
</p>

<ul class="org-ul">
<li>缩短完成最终一稿通常所需的时间；
</li>
<li>提高文章的条理性；
</li>
<li>缩短文章的长度。最终的结果是，使你能够在最短的时间内写出简明扼要、思路清晰的文章。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 第 1 篇 表达的逻辑</h3>
<div class="outline-text-3" id="text-3-3">
<p>
文章条理不清还有一个比上面提到的原因更常见、但也更容易改进的原因，即文
章的结构（structure）——也就是句子的组织顺序（不管句子本身写得是好是坏）。
</p>

<p>
金字塔结构中，思想之间的联系方式可以是纵向的（vertically）——即任何一个
层次上的思想都是对其下面一个层次上思想的总结；也可以是横向的
（horizontally）——即多个思想因共同组成同一个逻辑推理过程，而被并列排在一起。
</p>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> 第 1 章 为什么要用金字塔结构</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
如果你的文章结构呈金字塔形，文章的思路自金字塔顶部开始逐渐向下展开，那
么读者肯定会觉得你的文章比较容易读懂。
</p>

<dl class="org-dl">
<dt> 你可以通过检查你的思想是否用金字塔结构相互关联，从而确定你是否正确地构建了文章的结构。 </dt><dd><ul class="org-ul">
<li>金字塔中的思想以 3 种方式互相关联——向上、向下和横向。位于一组思想的上一个层次的思想是对这一组思想的概括，这一组思想则是对其上一层次思想的解释和支持。
</li>
<li>文章中任一层次上的思想必须是对其下一层次思想的总结概括
</li>
<li>每组中的思想必须属于同一逻辑范畴
</li>
<li>每组中的思想必须按照逻辑顺序组织 <br  />
</li>
</ul>
<p>
组织思想基本上只可能有4种逻辑顺序：
</p>
<ul class="org-ul">
<li>演绎顺序：大前提、小前提、结论
</li>
<li>时间（步骤）顺序：第一、第二、第三
</li>
<li>结构（空间）顺序：波士顿、纽约、华盛顿
</li>
<li>程度（重要性）顺序：最重要、次重要，等等
</li>
</ul>
</dd>
</dl>
</div>
<ol class="org-ol"><li><a id="sec-3-3-1-1" name="sec-3-3-1-1"></a>归类分组，将思想组织成金字塔<br  /><div class="outline-text-5" id="text-3-3-1-1">
<ul class="org-ul">
<li>逻辑关系
</li>
<li>7
</li>
<li>归类分组, 搭建金字塔
</li>
<li>找出逻辑关系, 抽象概括
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-1-2" name="sec-3-3-1-2"></a>自上而下表达，结论先行<br  /></li>
<li><a id="sec-3-3-1-3" name="sec-3-3-1-3"></a>自下而上思考，总结概括<br  /></li></ol>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> 第 2 章 金字塔内部的结构</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
金字塔中的子结构，能够加快你梳理思想的过程：
</p>
<ul class="org-ul">
<li>主题与子主题之间的纵向关系
</li>
<li>各子主题之间的横向关系
</li>
<li>序言的叙述方式
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-3-3-2-1" name="sec-3-3-2-1"></a>纵向关系<br  /><div class="outline-text-5" id="text-3-3-2-1">
<ul class="org-ul">
<li>这种表述之所以清晰，是因为其思想的组织一直紧紧围绕着回答由主题引发的读者的疑问。
</li>
<li>金字塔结构的巨大价值就在于它迫使你在理清思路时，从视觉上使纵向的疑问／回答式对话关系清晰化。
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-2-2" name="sec-3-3-2-2"></a>横向关系<br  /><div class="outline-text-5" id="text-3-3-2-2">
<ul class="org-ul">
<li>演绎性思想组合是由几个承前启后的论述组成的。
</li>
<li>归纳性思想组合中的思想互相关联，
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-2-3" name="sec-3-3-2-3"></a>序言的结构<br  /><div class="outline-text-5" id="text-3-3-2-3">
<p>
问题的起源和发展必然以叙述的形式出现，因此也应当按照典型的叙述模式发展。
序言的开头应向读者说明“背景”（situation）的时间和地点。
在这一背景中应当发生了某件事情，可称为“冲突”（complication），
使读者提出（或将使读者提出）你的文章将要“回答”（answer）的“疑问”（question）。
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> 第 3 章 如何构建金字塔</h4>
<div class="outline-text-4" id="text-3-3-3">
</div><ol class="org-ol"><li><a id="sec-3-3-3-1" name="sec-3-3-3-1"></a>自上而下法<br  /><div class="outline-text-5" id="text-3-3-3-1">
<p>
自上而下法构建金字塔的步骤：
</p>
<ul class="org-ul">
<li>提出主题思想。
</li>
<li>设想受众的主要疑问。
</li>
<li>写序言：背景－冲突－疑问－回答。
</li>
<li>与受众进行疑问/回答式对话。
</li>
<li>对受众的新疑问，重复进行疑问/回答式对话。
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-3-2" name="sec-3-3-3-2"></a>自下而上法<br  /><div class="outline-text-5" id="text-3-3-3-2">
<p>
自下而上思考：
</p>
<ul class="org-ul">
<li>列出你想表达的所有思想要点。
</li>
<li>找出各要点之间的逻辑关系。
</li>
<li>得出结论。
</li>
</ul>
</div>
</li>
<li><a id="sec-3-3-3-3" name="sec-3-3-3-3"></a>初学者注意事项<br  /><div class="outline-text-5" id="text-3-3-3-3">
<ul class="org-ul">
<li>一定先搭结构，先尝试自上而下法
</li>
<li>序言先写背景，将背景作为序言的起点
</li>
<li>先多花时间思考序言，不要省略
</li>
<li>将历史背景放在序言中
</li>
<li>序言仅涉及读者不会对其真实性提出质疑的内容
</li>
<li>在关键句层次上，更宜选择归纳推理法而非演绎论证法 (interesting)
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> 第 4 章 序言的具体写法</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
文章的序言（前言、引言、导言）概述读者已知的信息，并将这些信息与文章将
要回答的疑问建立联系，然后作者就可以将全部精力放在提供回答疑问的答案上。
如果是写文章，就是“序言”； <b>如果是演讲，就是“开场白”。</b>
</p>
</div>
<ol class="org-ol"><li><a id="sec-3-3-4-1" name="sec-3-3-4-1"></a>序言的讲故事结构<br  /><div class="outline-text-5" id="text-3-3-4-1">
<p>
