00001-combo-001.org
** Introduction
- http://tfwiki.net/wiki/Beast_Machines:_Transformers_(cartoon) ::
  The show follows the adventures of the core Beast Wars cast upon their
  return home to Cybertron; there, Optimus Primal and his crew find that
  the whole planet is abandoned, and the streets are patrolled by
  mindless Vehicon drones serving Megatron, who somehow escaped his
  captivity.

  Worse still, they learn that they are infected with a deadly virus
  that will kill them in a matter of hours. Salvation (我已经忘了救赎有
  拯救的含义在里面...) comes from the mysterious supercomputer known as
  the Oracle, who sees them fit to complete its mission of a planetwide
  "reformatting", and turns them into *technorganic warriors*, a perfect
  blend of organic and technological matter.

  As the show progresses, Primal and his fellow Maximals learn to
  balance their technological side with their newly introduced organic
  aspects, mastery coming in slow stages. Unlike the previous conflict,
  where sides had been roughly equal, the four original Maximals were
  quite *outnumbered by their Vehicon enemies*, and the battles took on a
  "*guerilla warfare*" feel, with the Maximals using sewers and
  underground levels to their advantage and avoiding surface levels
  unless for combat purposes. As the show progresses, two brand-new
  Maximals and a returning face boost their numbers.

  Initially, Optimus is driven by a crusade to restore the organic above
  the technological and to right his failure to stop Megatron. Over
  time, it becomes increasingly clear that he's becoming obsessed and
  overzealous. At the midpoint, after Cybertron is almost destroyed, he
  realises that the point should be to *create a balance of organic and
  technological, not a supremacy*. Under this new, saner cause, the
  Maximals eventually turn Cybertron into an technorganic paradise,
  though at the cost of their leader's life.
  (最后那也叫天堂... 一片荒地啊. 好遗憾 Megatron 失败了)
** Quotes
- http://www.imdb.com/title/tt0189315/quotes ::
  + Optimus Primal: What's wrong, Megatron? Is your"single elegant machine" having trouble multitasking?
  + Tankorr: Oh, I'm sorry. Were you happier when my vocabulary was limited to,'TANKORR SMASH'?
** Season 1
Season 1 largely centers on the Maximals' efforts to find out what has
happened to them, as they arrive on Cybertron with no memories. In
addition to Megatron and the core Maximal cast, three new Vehicon
generals are introduced, as well as the new Maximal Nightscream. By
the end of the season, Optimus Primal has been driven down a road of
extremism, and an apocalyptic confrontation marks the season finale...
*** The Reformatting
Escaping from strange new foes (敌人) and unable to transform, the four
surviving Maximals encounter a mysterious supercomputer which remakes
them into a new kind of Transformer.
*** Master of the House
*** Fires of the Past
*** Mercenary Pursuits
*** Forbidden Fruit
*** The Weak Component
*** Revelations Part I: Discovery
*** Revelations Part II: Descent
*** Revelations Part III: Apocalypse
*** Survivor
*** The Key
*** The Catalyst
*** End of the Line
** Season 2: Battle for the Spark
The ultimate face-off (对峙) at the end of Season 1 is resolved in a most
unusual and cerebral manner, setting the tone for Season 2 as Primal
realizes his mission is one of balance, not extremism. Silverbolt
rejoins the Maximal ranks, a new Maximal arrives from off-world, and
two dangerous new generals join Megatron's side as the Maximals search
for the lost Sparks of their brethren and battle to regain control of
Cybertron.
*** Fallout
*** Savage Noble
*** Prometheus Unbound
*** In Darkest Knight
*** A Wolf in the Fold
*** Home Soil
*** Sparkwar Pt. I: The Strike
*** Sparkwar Pt. II: The Search
*** Sparkwar Pt. III: The Siege
*** Spark of Darkness
*** Endgame Pt. I: The Downward Spiral
*** Endgame Pt. II: When Legends Fall
*** Endgame Pt. III: Seeds of the Future
