00001-combo-001.html
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Introduction</h3>
<div class="outline-text-3" id="text-4-1">
<dl class="org-dl">
<dt> <a href="http://tfwiki.net/wiki/Beast_Machines:_Transformers_(cartoon)">http://tfwiki.net/wiki/Beast_Machines:_Transformers_(cartoon)</a> </dt><dd>  The show follows the adventures of the core Beast Wars cast upon their
return home to Cybertron; there, Optimus Primal and his crew find that
the whole planet is abandoned, and the streets are patrolled by
mindless Vehicon drones serving Megatron, who somehow escaped his
captivity.

<p>
Worse still, they learn that they are infected with a deadly virus
that will kill them in a matter of hours. Salvation (我已经忘了救赎有
拯救的含义在里面&#x2026;) comes from the mysterious supercomputer known as
the Oracle, who sees them fit to complete its mission of a planetwide
"reformatting", and turns them into <b>technorganic warriors</b>, a perfect
blend of organic and technological matter.
</p>

<p>
As the show progresses, Primal and his fellow Maximals learn to
balance their technological side with their newly introduced organic
aspects, mastery coming in slow stages. Unlike the previous conflict,
where sides had been roughly equal, the four original Maximals were
quite <b>outnumbered by their Vehicon enemies</b>, and the battles took on a
"<b>guerilla warfare</b>" feel, with the Maximals using sewers and
underground levels to their advantage and avoiding surface levels
unless for combat purposes. As the show progresses, two brand-new
Maximals and a returning face boost their numbers.
</p>

<p>
Initially, Optimus is driven by a crusade to restore the organic above
the technological and to right his failure to stop Megatron. Over
time, it becomes increasingly clear that he's becoming obsessed and
overzealous. At the midpoint, after Cybertron is almost destroyed, he
realises that the point should be to <b>create a balance of organic and
technological, not a supremacy</b>. Under this new, saner cause, the
Maximals eventually turn Cybertron into an technorganic paradise,
though at the cost of their leader's life.
(最后那也叫天堂&#x2026; 一片荒地啊. 好遗憾 Megatron 失败了)
</p>
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Quotes</h3>
<div class="outline-text-3" id="text-4-2">
<dl class="org-dl">
<dt> <a href="http://www.imdb.com/title/tt0189315/quotes">http://www.imdb.com/title/tt0189315/quotes</a> </dt><dd><ul class="org-ul">
<li>Optimus Primal: What's wrong, Megatron? Is your"single elegant machine" having trouble multitasking?
</li>
<li>Tankorr: Oh, I'm sorry. Were you happier when my vocabulary was limited to,'TANKORR SMASH'?
</li>
</ul>
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Season 1</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Season 1 largely centers on the Maximals' efforts to find out what has
happened to them, as they arrive on Cybertron with no memories. In
addition to Megatron and the core Maximal cast, three new Vehicon
generals are introduced, as well as the new Maximal Nightscream. By
the end of the season, Optimus Primal has been driven down a road of
extremism, and an apocalyptic confrontation marks the season finale&#x2026;
</p>
</div>
<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> The Reformatting</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Escaping from strange new foes (敌人) and unable to transform, the four
surviving Maximals encounter a mysterious supercomputer which remakes
them into a new kind of Transformer.
</p>
</div>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Master of the House</h4>
</div>
<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> Fires of the Past</h4>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> Mercenary Pursuits</h4>
</div>
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> Forbidden Fruit</h4>
</div>
<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> The Weak Component</h4>
</div>
<div id="outline-container-sec-4-3-7" class="outline-4">
<h4 id="sec-4-3-7"><span class="section-number-4">4.3.7</span> Revelations Part I: Discovery</h4>
</div>
<div id="outline-container-sec-4-3-8" class="outline-4">
<h4 id="sec-4-3-8"><span class="section-number-4">4.3.8</span> Revelations Part II: Descent</h4>
</div>
<div id="outline-container-sec-4-3-9" class="outline-4">
<h4 id="sec-4-3-9"><span class="section-number-4">4.3.9</span> Revelations Part III: Apocalypse</h4>
</div>
<div id="outline-container-sec-4-3-10" class="outline-4">
<h4 id="sec-4-3-10"><span class="section-number-4">4.3.10</span> Survivor</h4>
</div>
<div id="outline-container-sec-4-3-11" class="outline-4">
<h4 id="sec-4-3-11"><span class="section-number-4">4.3.11</span> The Key</h4>
</div>
<div id="outline-container-sec-4-3-12" class="outline-4">
<h4 id="sec-4-3-12"><span class="section-number-4">4.3.12</span> The Catalyst</h4>
</div>
<div id="outline-container-sec-4-3-13" class="outline-4">
<h4 id="sec-4-3-13"><span class="section-number-4">4.3.13</span> End of the Line</h4>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Season 2: Battle for the Spark</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The ultimate face-off (对峙) at the end of Season 1 is resolved in a most
unusual and cerebral manner, setting the tone for Season 2 as Primal
realizes his mission is one of balance, not extremism. Silverbolt
rejoins the Maximal ranks, a new Maximal arrives from off-world, and
two dangerous new generals join Megatron's side as the Maximals search
for the lost Sparks of their brethren and battle to regain control of
Cybertron.
</p>
</div>
<div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Fallout</h4>
</div>
<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> Savage Noble</h4>
</div>
<div id="outline-container-sec-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> Prometheus Unbound</h4>
</div>
<div id="outline-container-sec-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> In Darkest Knight</h4>
</div>
<div id="outline-container-sec-4-4-5" class="outline-4">
<h4 id="sec-4-4-5"><span class="section-number-4">4.4.5</span> A Wolf in the Fold</h4>
</div>
<div id="outline-container-sec-4-4-6" class="outline-4">
<h4 id="sec-4-4-6"><span class="section-number-4">4.4.6</span> Home Soil</h4>
</div>
<div id="outline-container-sec-4-4-7" class="outline-4">
<h4 id="sec-4-4-7"><span class="section-number-4">4.4.7</span> Sparkwar Pt. I: The Strike</h4>
</div>
<div id="outline-container-sec-4-4-8" class="outline-4">
<h4 id="sec-4-4-8"><span class="section-number-4">4.4.8</span> Sparkwar Pt. II: The Search</h4>
</div>
<div id="outline-container-sec-4-4-9" class="outline-4">
<h4 id="sec-4-4-9"><span class="section-number-4">4.4.9</span> Sparkwar Pt. III: The Siege</h4>
</div>
<div id="outline-container-sec-4-4-10" class="outline-4">
<h4 id="sec-4-4-10"><span class="section-number-4">4.4.10</span> Spark of Darkness</h4>
</div>
<div id="outline-container-sec-4-4-11" class="outline-4">
<h4 id="sec-4-4-11"><span class="section-number-4">4.4.11</span> Endgame Pt. I: The Downward Spiral</h4>
</div>
<div id="outline-container-sec-4-4-12" class="outline-4">
<h4 id="sec-4-4-12"><span class="section-number-4">4.4.12</span> Endgame Pt. II: When Legends Fall</h4>
</div>
<div id="outline-container-sec-4-4-13" class="outline-4">
<h4 id="sec-4-4-13"><span class="section-number-4">4.4.13</span> Endgame Pt. III: Seeds of the Future</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TANG ZhiXiong</p>
<p class="date">Created: 2017-10-07 Sat 13:02</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
